In [1]:
try:
    file=open('data.csv','x')
    file.close()
except:
    print("Already exist file")

In [2]:
file=open('data.csv','r')
x=file.read()
print(x)
file.close()

sn,name,age,address,phone
1,Ram,20,ktm,9841000000
2,Sita,19,patan,9842315678
3,Shyam,21,bkth,8942312345
4,Gita,18,chitwan,9841111123
5,Sagar,22,lalitpur,98411234509
6,Sabita,23,boudha,9865023145
7,Renu,22,biratnagar,9843137580

1st represent the cloumn name and other as rows

In [11]:
import pandas as pd
df = pd.read_csv('data.csv')
print(df)

   sn    name  age     address        phone
0   1     Ram   20         ktm   9841000000
1   2    Sita   19       patan   9842315678
2   3   Shyam   21        bkth   8942312345
3   4    Gita   18     chitwan   9841111123
4   5   Sagar   22    lalitpur  98411234509
5   6  Sabita   23      boudha   9865023145
6   7    Renu   22  biratnagar   9843137580

In [5]:
df=pd.read_csv(file_path->'data.csv',argument->nrows=5)
df

   sn   name  age   address        phone
0   1    Ram   20       ktm   9841000000
1   2   Sita   19     patan   9842315678
2   3  Shyam   21      bkth   8942312345
3   4   Gita   18   chitwan   9841111123
4   5  Sagar   22  lalitpur  98411234509

df.head()->to display topmost value upto 5 default value ie 5
if we write
df.write(2)-> displays top 2 value 
df.tail()-> to display lastmost 5 value
nrows=some_value ->argument passed tov display no of rows the name of argument is fixed

In [6]:
df=pd.read_csv('data.csv')
df.head()

   sn   name  age   address        phone
0   1    Ram   20       ktm   9841000000
1   2   Sita   19     patan   9842315678
2   3  Shyam   21      bkth   8942312345
3   4   Gita   18   chitwan   9841111123
4   5  Sagar   22  lalitpur  98411234509

In [10]:
df=pd.read_csv('data.csv')
df.tail()# by defult 5

   sn    name  age     address        phone
2   3   Shyam   21        bkth   8942312345
3   4    Gita   18     chitwan   9841111123
4   5   Sagar   22    lalitpur  98411234509
5   6  Sabita   23      boudha   9865023145
6   7    Renu   22  biratnagar   9843137580

in tabular data there are two axeses they are axis 0 and 1
horizontal line=1axis
vertical line=0axis(uncolumned indexed)
here,
reference column should be declared in order to avoid the duplication of value.ie sn
df=pd.read_csv('file_path',index_col='reference_clumn name')---->

In [12]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df.head()

     name  age   address        phone
sn
1     Ram   20       ktm   9841000000
2    Sita   19     patan   9842315678
3   Shyam   21      bkth   8942312345
4    Gita   18   chitwan   9841111123
5   Sagar   22  lalitpur  98411234509

Here sn is index column

loc-->localizer
iloc-->index localizer
when we want data from random row access we will use iloc
syntax:
      df.iloc[starting index:ending_index] (runs from starting points to ending points-1)
      df.iloc[1:5,0:2] here before comma row value can be accessed and after comma  specific column can be selected note:reference key is not included so 0 index of column is name in above example

In [13]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df.iloc[1:6]

      name  age   address        phone
sn
2     Sita   19     patan   9842315678
3    Shyam   21      bkth   8942312345
4     Gita   18   chitwan   9841111123
5    Sagar   22  lalitpur  98411234509
6   Sabita   23    boudha   9865023145

In [14]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df.iloc[1:6,0:3]

      name  age   address
sn
2     Sita   19     patan
3    Shyam   21      bkth
4     Gita   18   chitwan
5    Sagar   22  lalitpur
6   Sabita   23    boudha

loc-->according to reference key we can access the specific rows
syntax:
      df.loc[2:5] here, 2 to 5 means reference key value is pointed ##note: here, 2 to 5 sama ko value display huncha not 2:5-1
      if, our reference key is name we can write sita:sabita and index_col='name'

In [15]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df.loc[1:5]#sn ko 1 dekhi 5 sama value retrive huncha note

     name  age   address        phone
sn
1     Ram   20       ktm   9841000000
2    Sita   19     patan   9842315678
3   Shyam   21      bkth   8942312345
4    Gita   18   chitwan   9841111123
5   Sagar   22  lalitpur  98411234509

# # TO READ OF DIFFERENT COLUMNS:

indorder to skip any column we will use argument usecols=['col_1','col_2','col_4'] and so on  note:indexe_col should be included in usecols['sn']

In [18]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn',usecols=['sn','phone','name'])
print(df)

      name        phone
sn
1      Ram   9841000000
2     Sita   9842315678
3    Shyam   8942312345
4     Gita   9841111123
5    Sagar  98411234509
6   Sabita   9865023145
7     Renu   9843137580

#filtering
selecting rows in term of conditions
select* from data.csv where name='any_name' is eqivalent to -->df['name']=='any_name'

Here output will be in boolean form where the condition is  true in that row the value=true otherwise false
inorder to return value the syntax will be:
Syntax:
      df[df['name']=='any_name']

In [19]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df['name']

sn
1       Ram
2      Sita
3     Shyam
4      Gita
5     Sagar
6    Sabita
7      Renu
Name: name, dtype: object

In [20]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df['name']=='Ram'

sn
1     True
2    False
3    False
4    False
5    False
6    False
7    False
Name: name, dtype: bool

In [21]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df[df['name']=='Ram']

   name  age address       phone
sn
1   Ram   20     ktm  9841000000

In [22]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df[df['age']>20]

      name  age     address        phone
sn
3    Shyam   21        bkth   8942312345
5    Sagar   22    lalitpur  98411234509
6   Sabita   23      boudha   9865023145
7     Renu   22  biratnagar   9843137580

In [28]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
df[(df['age']>20) & (df['address']=='boudha')]

      name  age address       phone
sn
6   Sabita   23  boudha  9865023145

In pandas only value are retrive we cannot perform any CURD operation but CURD can be performend in data frame only not in csv file
Here, we will retrive value from source and make it another file bf filtering

In [29]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
data=df[(df['age']>20) & (df['address']=='boudha')]
data.to_csv('new_data.csv')

In [1]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='sn')
data=df[(df['age']>20) & (df['address']=='boudha')]
data.to_json('new_data.json')#web developer used json file mostof them

#read and write through file:

In [2]:
import pandas as pd
info={'name':[],'age':[],'address':[],'phone':[]}
n=int(input("Enter n="))
for i in range(n):
    name=input("Enter name=")
    age=int(input("Enter age="))
    address=input("Enter address=")
    phone=int(input("Enter phone number="))
    info['name'].append(name)
    info['age'].append(age)
    info['address'].append(address)
    info['phone'].append(phone)
print(info)

Enter n=2
Enter name=ram
Enter age=21
Enter address=ktm
Enter phone number=984100000
Enter name=sita
Enter age=22
Enter address=patan
Enter phone number=984231345
{'name': ['ram', 'sita'], 'age': [21, 22], 'address': ['ktm', 'patan'], 'phone': [984100000, 984231345]}

converting above dictionary to dataframe

In [16]:
import pandas as pd
df=pd.DataFrame(info)
df.to_csv('info.csv')
df

   name  age address      phone
0   ram   21     ktm  984100000
1  sita   22   patan  984231345

csv package sholud be imported if the data are in list or dictionary form

In [6]:
import csv
l=[2,'Sabita',23,'boudha','9865023145']
file=open('info.csv','a')
x=csv.writer(file)#x is object where csv ko package bata writer vana function use garara file lai write garna ho
x.writerow(l)#writerow is used to insert the list that is already predefined
file.close()

In [17]:
import pandas as pd
df=pd.read_csv('info.csv')
df

   Unnamed: 0  name  age address      phone
0           0   ram   21     ktm  984100000
1           1  sita   22   patan  984231345

In [8]:
import csv
l=[['sn','name','age','address','phone'],
   [1,'Ram',21,'ktm',98410000],
   [2,'Sita',20,'patan',344035049],
   [3,'gopal',19,'bkth',354645367]]
file=open('info1.csv','w')
x=csv.writer(file)
x.writerows(l)# multiple line insertion ko lagi writerows() ho fxn for single writerow()
file.close()

In [15]:
import pandas as pd
df=pd.read_csv('info1.csv')
df

   sn   name  age address      phone
0   1    Ram   21     ktm   98410000
1   2   Sita   20   patan  344035049
2   3  gopal   19    bkth  354645367

# Dictionary reader
to read in form of dictionary format
we have to use syntax:
 reader=csv.DictReader(fie to be read)

In [11]:
import csv
file=open('info1.csv')
reader=csv.DictReader(file)
for row in reader:
    print(row)

{'sn': '1', 'name': 'Ram', 'age': '21', 'address': 'ktm', 'phone': '98410000'}
{'sn': '2', 'name': 'Sita', 'age': '20', 'address': 'patan', 'phone': '344035049'}
{'sn': '3', 'name': 'gopal', 'age': '19', 'address': 'bkth', 'phone': '354645367'}

# to make list

In [12]:
import csv
final_data=[]
file=open('info1.csv')
reader=csv.DictReader(file)

for row in reader:
    final_data.append(row)
    
print(final_data)

[{'sn': '1', 'name': 'Ram', 'age': '21', 'address': 'ktm', 'phone': '98410000'}, {'sn': '2', 'name': 'Sita', 'age': '20', 'address': 'patan', 'phone': '344035049'}, {'sn': '3', 'name': 'gopal', 'age': '19', 'address': 'bkth', 'phone': '354645367'}]

In [13]:
import csv
csv_column=['sn','name','age','address','phone']
dicts=final_data
file=open('data1.csv','w')
writer=csv.DictWriter(file,fieldnames=csv_column)
writer.writeheader()
writer.writerows(dicts)
file.close()

In [14]:
import pandas as pd
df=pd.read_csv('data1.csv')
df

   sn   name  age address      phone
0   1    Ram   21     ktm   98410000
1   2   Sita   20   patan  344035049
2   3  gopal   19    bkth  354645367

In [21]:
import pandas as pd
df=pd.read_csv('data1.csv', index_col='sn')# deleting row from dataframe
df=df.drop([2,3],axis=0)
df

   name  age address     phone
sn
1   Ram   21     ktm  98410000

In [24]:
import pandas as pd
df=pd.read_csv('data1.csv')

df=df.drop(['address'],axis=1)# deleting cols from dataframe
df

   sn   name  age      phone
0   1    Ram   21   98410000
1   2   Sita   20  344035049
2   3  gopal   19  354645367

In [26]:
import pandas as pd
df=pd.read_csv('data1.csv', index_col='name')# deleting row from dataframe
df=df.drop(['Ram','Sita'],axis=0)
df

       sn  age address      phone
name
gopal   3   19    bkth  354645367

In [1]:
pwd

'C:\\Users\\LENOVO\\python530'